{
  "disclaimer": "This application is a fan-made project designed to assist with debugging Factorio’s circuit network. It is created by fans for fans, with the sole purpose of enhancing the gaming experience. We do not own any of the images used in this application. All image properties and rights are owned by Wube Software, the developers of Factorio. If you enjoy Factorio and find this tool helpful, please consider supporting the developers by visiting https://factorio.com/. This is an open-source project, and you can find the source code at https://github.com/Mouraoea/circuitorio",
  "changeLog": [
    { "version": "alpha-0.1.13", "content": "Added blueprint compressor/decompressor" },
    { "version": "alpha-0.1.12", "content": "Added operator sprites to combinators, more code refacoring, bug fixes" },
    { "version": "alpha-0.1.11", "content": "Code refactor, minor bug fixes" },
    { "version": "alpha-0.1.10", "content": "Added save signals to store" },
    { "version": "alpha-0.1.09", "content": "Added constant field and confirm signal at signal picker UI" },
    { "version": "alpha-0.1.08", "content": "Added signal picker UI" },
    { "version": "alpha-0.1.07", "content": "Hotfix for changeLog infinite download request loop" },
    {
      "version": "alpha-0.1.06",
      "content": "Added entity selection. Added support code for dynamically updated hovered and selected entity. Added colision detection for rotating entities, Added entity interface"
    },
    { "version": "alpha-0.1.05", "content": "Removed drag and drop feature. This will be replaced by the in-game select -> move feature in the future" },
    { "version": "alpha-0.1.04", "content": "Added help button" },
    { "version": "alpha-0.1.03", "content": "Added remove entity with mouse button 2 functionality" },
    { "version": "alpha-0.1.02", "content": "Colision detection" },
    { "version": "alpha-0.1.01", "content": "Added roadmap" },
    { "version": "alpha-0.1.0", "content": "Initial release of the application. This version includes basic functionality for adding and moving combinators, camera control, and drawer panels" }
  ],
  "roadmap": [
    "Add support for connecting combinators with wires",
    "Add support for saving and loading blueprints",
    "Add support for importing and exporting blueprints",
    "Add support for editing circuit network signals",
    "Add support for editing circuit network conditions",
    "Add support for editing circuit network connections",
    "Add support for editing circuit network filters",
    "Add support for editing circuit network arithmetic",
    "Add support for editing circuit network decider",
    "Add support for editing circuit network constant combinators",
    "Add support for editing circuit network power switches",
    "Add support for editing circuit network power poles",
    "Add support for editing circuit network train stations",
    "Add support for editing circuit network train signals",
    "Add support for editing circuit network train rail signals",
    "Add support for editing circuit network train chain signals",
    "Add support for selecting multiple entities",
    "Add support for moving entities",
    "Add tutorial scenarios",
    "Add belt inventory",
    "Add drawing canvas"
  ]
}
